:PROPERTIES:
:ID:       c1c473db-3b31-4ed6-bf8d-69f2af5f901f
:END:
#+title: loop device
#+filetags: :linux:filesystem:
#+startup: num fold
loop device (pseudo device)
A loop device is a regular file that is mounted as a file system
this file may be an =.iso=, =.img= ...etc
one of the main reasons we use a loop device on a file, so that we can interact with it using block-device [[id:114edd72-bdff-4c16-a1e4-130fb0f6a8b9][API]]

So the role of the loop device driver on your system, is to translate any block device requests or operations
to that loop device into a filesystem operation (which is the real thing underneath)

* mount an .iso file as a loop device
mount has an options called loop that let you mount an .iso file as a loop device

#+begin_src sh :results none
  # mount -o loop=/dev/loop0 file.iso /mnt
  lsblk 
#+end_src

#+RESULTS:
#+begin_example
NAME   MAJ:MIN RM   SIZE RO TYPE MOUNTPOINTS
loop0    7:0    0   1.7G  0 loop /mnt
...
#+end_example

#+begin_src sh :results none
  df -hT | grep loop0
#+end_src

#+RESULTS:
: /dev/loop0     iso9660   1.8G  1.8G     0 100% /mnt
* another example using dd
this example is from the =losetup= man page
#+begin_src sh :results none
  dd if=/dev/zero of=./file.img bs=1024k count=10
  losetup --find --show ./file.img
#+end_src

#+RESULTS:
: /dev/loop0

#+begin_src sh :results none
  mkfs -t ext2 /dev/loop0
  mount /dev/loop0 /mnt
  ...
  umount /dev/loop0
  # we can use -d for short
  losetup --detach /dev/loop0
#+end_src

#+RESULTS:

[[id:bcc7c896-6189-4bab-8f91-bd0ce599b6a4][ext4 filesystem]]

